RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_SAI.h
/*
** ###################################################################
**     Processor:           S32K344
**     Reference manual:    S32K3xx RM Rev.3
**     Version:             rev. 1.9, 2021-10-27
**     Build:               b211026
**
**     Abstract:
**         Peripheral Access Layer for S32K344
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2021 NXP
**
**     NXP Confidential. This software is owned or controlled by NXP and may only be
**     used strictly in accordance with the applicable license terms. By expressly
**     accepting such terms or by downloading, installing, activating and/or otherwise
**     using the software, you are agreeing that you have read, and that you agree to
**     comply with and are bound by, such license terms. If you do not agree to be
**     bound by the applicable license terms, then you may not retain, install,
**     activate or otherwise use the software. The production use license in
**     Section 2.3 is expressly granted for this software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K344_SAI.h
 * @version 1.9
 * @date 2021-10-27
 * @brief Peripheral Access Layer for S32K344_SAI
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K344_SAI_H_)  /* Check if memory map has not been already included */
#define S32K344_SAI_H_

#include "S32K344_COMMON.h"

/* ----------------------------------------------------------------------------
   -- SAI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SAI_Peripheral_Access_Layer SAI Peripheral Access Layer
 * @{
 */

/** SAI - Size of Registers Arrays */
#define SAI_TDR_COUNT                             4u
#define SAI_TFR_COUNT                             4u
#define SAI_RDR_COUNT                             4u
#define SAI_RFR_COUNT                             4u

/** SAI - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< Version ID, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< Parameter, offset: 0x4 */
  __IO uint32_t TCSR;                              /**< Transmit Control, offset: 0x8 */
  __IO uint32_t TCR1;                              /**< Transmit Configuration 1, offset: 0xC */
  __IO uint32_t TCR2;                              /**< Transmit Configuration 2, offset: 0x10 */
  __IO uint32_t TCR3;                              /**< Transmit Configuration 3, offset: 0x14 */
  __IO uint32_t TCR4;                              /**< Transmit Configuration 4, offset: 0x18 */
  __IO uint32_t TCR5;                              /**< Transmit Configuration 5, offset: 0x1C */
  __O  uint32_t TDR[SAI_TDR_COUNT];                /**< Transmit Data, array offset: 0x20, array step: 0x4 */
  uint8_t RESERVED_0[16];
  __I  uint32_t TFR[SAI_TFR_COUNT];                /**< Transmit FIFO, array offset: 0x40, array step: 0x4 */
  uint8_t RESERVED_1[16];
  __IO uint32_t TMR;                               /**< Transmit Mask, offset: 0x60 */
  uint8_t RESERVED_2[36];
  __IO uint32_t RCSR;                              /**< Receive Control, offset: 0x88 */
  __IO uint32_t RCR1;                              /**< Receive Configuration 1, offset: 0x8C */
  __IO uint32_t RCR2;                              /**< Receive Configuration 2, offset: 0x90 */
  __IO uint32_t RCR3;                              /**< Receive Configuration 3, offset: 0x94 */
  __IO uint32_t RCR4;                              /**< Receive Configuration 4, offset: 0x98 */
  __IO uint32_t RCR5;                              /**< Receive Configuration 5, offset: 0x9C */
  __I  uint32_t RDR[SAI_RDR_COUNT];                /**< Receive Data, array offset: 0xA0, array step: 0x4 */
  uint8_t RESERVED_3[16];
  __I  uint32_t RFR[SAI_RFR_COUNT];                /**< Receive FIFO, array offset: 0xC0, array step: 0x4 */
  uint8_t RESERVED_4[16];
  __IO uint32_t RMR;                               /**< Receive Mask, offset: 0xE0 */
} SAI_Type, *SAI_MemMapPtr;

/** Number of instances of the SAI module. */
#define SAI_INSTANCE_COUNT                       (2u)

/* SAI - Peripheral instance base addresses */
/** Peripheral SAI_0 base address */
#define IP_SAI_0_BASE                            (0x4036C000u)
/** Peripheral SAI_0 base pointer */
#define IP_SAI_0                                 ((SAI_Type *)IP_SAI_0_BASE)
/** Peripheral SAI_1 base address */
#define IP_SAI_1_BASE                            (0x404DC000u)
/** Peripheral SAI_1 base pointer */
#define IP_SAI_1                                 ((SAI_Type *)IP_SAI_1_BASE)
/** Array initializer of SAI peripheral base addresses */
#define IP_SAI_BASE_ADDRS                        { IP_SAI_0_BASE, IP_SAI_1_BASE }
/** Array initializer of SAI peripheral base pointers */
#define IP_SAI_BASE_PTRS                         { IP_SAI_0, IP_SAI_1 }

/* ----------------------------------------------------------------------------
   -- SAI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SAI_Register_Masks SAI Register Masks
 * @{
 */

