RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_SAI.h
/*! @name VERID - Version ID */
/*! @{ */

#define SAI_VERID_FEATURE_MASK                   (0xFFFFU)
#define SAI_VERID_FEATURE_SHIFT                  (0U)
#define SAI_VERID_FEATURE_WIDTH                  (16U)
#define SAI_VERID_FEATURE(x)                     (((uint32_t)(((uint32_t)(x)) << SAI_VERID_FEATURE_SHIFT)) & SAI_VERID_FEATURE_MASK)

#define SAI_VERID_MINOR_MASK                     (0xFF0000U)
#define SAI_VERID_MINOR_SHIFT                    (16U)
#define SAI_VERID_MINOR_WIDTH                    (8U)
#define SAI_VERID_MINOR(x)                       (((uint32_t)(((uint32_t)(x)) << SAI_VERID_MINOR_SHIFT)) & SAI_VERID_MINOR_MASK)

#define SAI_VERID_MAJOR_MASK                     (0xFF000000U)
#define SAI_VERID_MAJOR_SHIFT                    (24U)
#define SAI_VERID_MAJOR_WIDTH                    (8U)
#define SAI_VERID_MAJOR(x)                       (((uint32_t)(((uint32_t)(x)) << SAI_VERID_MAJOR_SHIFT)) & SAI_VERID_MAJOR_MASK)
/*! @} */

/*! @name PARAM - Parameter */
/*! @{ */

#define SAI_PARAM_DATALINE_MASK                  (0xFU)
#define SAI_PARAM_DATALINE_SHIFT                 (0U)
#define SAI_PARAM_DATALINE_WIDTH                 (4U)
#define SAI_PARAM_DATALINE(x)                    (((uint32_t)(((uint32_t)(x)) << SAI_PARAM_DATALINE_SHIFT)) & SAI_PARAM_DATALINE_MASK)

#define SAI_PARAM_FIFO_MASK                      (0xF00U)
#define SAI_PARAM_FIFO_SHIFT                     (8U)
#define SAI_PARAM_FIFO_WIDTH                     (4U)
#define SAI_PARAM_FIFO(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_PARAM_FIFO_SHIFT)) & SAI_PARAM_FIFO_MASK)

#define SAI_PARAM_FRAME_MASK                     (0xF0000U)
#define SAI_PARAM_FRAME_SHIFT                    (16U)
#define SAI_PARAM_FRAME_WIDTH                    (4U)
#define SAI_PARAM_FRAME(x)                       (((uint32_t)(((uint32_t)(x)) << SAI_PARAM_FRAME_SHIFT)) & SAI_PARAM_FRAME_MASK)
/*! @} */

/*! @name TCSR - Transmit Control */
/*! @{ */

#define SAI_TCSR_FRDE_MASK                       (0x1U)
#define SAI_TCSR_FRDE_SHIFT                      (0U)
#define SAI_TCSR_FRDE_WIDTH                      (1U)
#define SAI_TCSR_FRDE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FRDE_SHIFT)) & SAI_TCSR_FRDE_MASK)

#define SAI_TCSR_FWDE_MASK                       (0x2U)
#define SAI_TCSR_FWDE_SHIFT                      (1U)
#define SAI_TCSR_FWDE_WIDTH                      (1U)
#define SAI_TCSR_FWDE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FWDE_SHIFT)) & SAI_TCSR_FWDE_MASK)

#define SAI_TCSR_FRIE_MASK                       (0x100U)
#define SAI_TCSR_FRIE_SHIFT                      (8U)
#define SAI_TCSR_FRIE_WIDTH                      (1U)
#define SAI_TCSR_FRIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FRIE_SHIFT)) & SAI_TCSR_FRIE_MASK)

#define SAI_TCSR_FWIE_MASK                       (0x200U)
#define SAI_TCSR_FWIE_SHIFT                      (9U)
#define SAI_TCSR_FWIE_WIDTH                      (1U)
#define SAI_TCSR_FWIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FWIE_SHIFT)) & SAI_TCSR_FWIE_MASK)

#define SAI_TCSR_FEIE_MASK                       (0x400U)
#define SAI_TCSR_FEIE_SHIFT                      (10U)
#define SAI_TCSR_FEIE_WIDTH                      (1U)
#define SAI_TCSR_FEIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FEIE_SHIFT)) & SAI_TCSR_FEIE_MASK)

#define SAI_TCSR_SEIE_MASK                       (0x800U)
#define SAI_TCSR_SEIE_SHIFT                      (11U)
#define SAI_TCSR_SEIE_WIDTH                      (1U)
#define SAI_TCSR_SEIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_SEIE_SHIFT)) & SAI_TCSR_SEIE_MASK)

#define SAI_TCSR_WSIE_MASK                       (0x1000U)
#define SAI_TCSR_WSIE_SHIFT                      (12U)
#define SAI_TCSR_WSIE_WIDTH                      (1U)
#define SAI_TCSR_WSIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_WSIE_SHIFT)) & SAI_TCSR_WSIE_MASK)

#define SAI_TCSR_FRF_MASK                        (0x10000U)
#define SAI_TCSR_FRF_SHIFT                       (16U)
#define SAI_TCSR_FRF_WIDTH                       (1U)
#define SAI_TCSR_FRF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FRF_SHIFT)) & SAI_TCSR_FRF_MASK)

#define SAI_TCSR_FWF_MASK                        (0x20000U)
#define SAI_TCSR_FWF_SHIFT                       (17U)
#define SAI_TCSR_FWF_WIDTH                       (1U)
#define SAI_TCSR_FWF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FWF_SHIFT)) & SAI_TCSR_FWF_MASK)

#define SAI_TCSR_FEF_MASK                        (0x40000U)
#define SAI_TCSR_FEF_SHIFT                       (18U)
#define SAI_TCSR_FEF_WIDTH                       (1U)
#define SAI_TCSR_FEF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FEF_SHIFT)) & SAI_TCSR_FEF_MASK)

#define SAI_TCSR_SEF_MASK                        (0x80000U)
#define SAI_TCSR_SEF_SHIFT                       (19U)
#define SAI_TCSR_SEF_WIDTH                       (1U)
#define SAI_TCSR_SEF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_SEF_SHIFT)) & SAI_TCSR_SEF_MASK)

#define SAI_TCSR_WSF_MASK                        (0x100000U)
#define SAI_TCSR_WSF_SHIFT                       (20U)
#define SAI_TCSR_WSF_WIDTH                       (1U)
#define SAI_TCSR_WSF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_WSF_SHIFT)) & SAI_TCSR_WSF_MASK)

#define SAI_TCSR_SR_MASK                         (0x1000000U)
#define SAI_TCSR_SR_SHIFT                        (24U)
#define SAI_TCSR_SR_WIDTH                        (1U)
#define SAI_TCSR_SR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_SR_SHIFT)) & SAI_TCSR_SR_MASK)

#define SAI_TCSR_FR_MASK                         (0x2000000U)
#define SAI_TCSR_FR_SHIFT                        (25U)
#define SAI_TCSR_FR_WIDTH                        (1U)
#define SAI_TCSR_FR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FR_SHIFT)) & SAI_TCSR_FR_MASK)

#define SAI_TCSR_BCE_MASK                        (0x10000000U)
#define SAI_TCSR_BCE_SHIFT                       (28U)
#define SAI_TCSR_BCE_WIDTH                       (1U)
#define SAI_TCSR_BCE(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_BCE_SHIFT)) & SAI_TCSR_BCE_MASK)

#define SAI_TCSR_DBGE_MASK                       (0x20000000U)
#define SAI_TCSR_DBGE_SHIFT                      (29U)
#define SAI_TCSR_DBGE_WIDTH                      (1U)
#define SAI_TCSR_DBGE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_DBGE_SHIFT)) & SAI_TCSR_DBGE_MASK)

